HELLO = (
    'Добро пожаловать {name}. Вас приветствует бот по парсингу данных '
    'с видеохостинга Rutube. Скопируйте и вставьте сюда ссылку '
    'на канал автора.\nКорректная ссылка:  '
    'https://rutube.ru/channel/23704195/.'
)

CORRECT_URL = (
    'Ссылка на канал RUTUBE корректна. Теперь введите количество '
    'видео для парсинга.'
)

INCORRECT_URL = (
    'Некорректная ссылка на канал RUTUBE. Пожалуйста, введите '
    'правильную ссылку.'
)

NUMBER_ERROR = 'Пожалуйста, укажите положительное число.'

INTAGER_ERROR = 'Пожалуйста, введите целое число.'

EMPTY_MESSAGE = 'Введите команду /start для начала парсинга.'
